[frmMain]
mnuLanguage.Caption=Langue(Language)

pmnuExitTheSystem.Caption=Système de sortie

mnuSystemSettings.Caption=Configuration du système
mnuParameterSetting.Caption=Paramètres
mnuBootUp.Caption=Démarre.
mnuExitTheSystem.Caption=Système de sortie

mnuReportTools.Caption=Outil de rapport
mnuReportDesign.Caption=Rapport Design

mnuPrintLog.Caption=Afficher le Journal d 'impression


mnuJsonTools.Caption=Outil d 'essai json(bejson.com)
mnuBase64.Caption=Base64 and image conversion
mnuUrlEncode.Caption=Codage / décodage d 'URL
mnuSSLTools.Caption=Outil de conversion de format de certificat SSL
mnuOpenTheRootDirectory.Caption=Ouvrir un répertoire
mnuOpenReportDirectory.Caption=Ouvrir le répertoire des rapports
mnuOpenLogDirectory.Caption=Ouvrir le journal
mnuOpenTheOutputfileDirectory.Caption=Ouvrir la liste des fichiers de sortie
mnuWindowDisplay.Caption=Affichage de fenêtre
mnuHttpPrint.Caption=Impression HTML
mnuMqttPrint.Caption=Impression mqtt
mnuCamera.Caption=Caméra
mnuIdCard.Caption=Carte d 'identité
mnuGridreport.Caption=Gridreport
mnuFastreport.Caption=Fastreport
mnuReportmachine.Caption=Reportmachine
mnuSystemHelp.Caption=Système d 'aide
mnuAboutUs.Caption=Sur nous

ts_http_print.Caption=Impression HTML
lblPort.Caption=Port
rb_print.Caption=Imprimer
rb_Preview.Caption=Aperçu
ButtonStart.Caption=Démarrage
ButtonStop.Caption=Arrêter

ts_mqtt_print.Caption=Impression mqtt
gb_mqtt.Caption=Serveur mqtt
lbl_mqtt_server_address.Caption=Adresse
lbl_mqtt_server_port.Caption=Port
lbl_mqtt_server_username.Caption=Nom d 'utilisateur
lbl_mqtt_server_userpwd.Caption=Mot de passe
lbl_mqtt_server_subscribe_topic.Caption=Abonnement
lbl_mqtt_server_print_verification_code.Caption=Imprimer le code d 'authentification
ButtonStart_mqtt.Caption=Démarrage
ButtonStop_mqtt.Caption=Arrêter

ts_camera.Caption=Caméra
lbl_camera_device_list.Caption=Liste de périphériques
lbl_camera_resolution.Caption=Résolution
btn_open_camera.Caption=Allumez la caméra.
btn_close_camera.Caption=Coupez la caméra.
chk_auto_open_camera.Caption=Démarrage automatique de la caméra
chk_pal_b.Caption=écran anti - flash
chk_auto_top.Caption=Dessus de la forme (toujours à l'avant)

ts_idcard.Caption=Carte d 'identité
lbl_idcard_name.Caption=Nom
lbl_idcard_sex.Caption=Sexe
lbl_idcard_nation.Caption=Ethnie
lbl_idcard_birthday.Caption=Date de naissance
lbl_idcard_id.Caption=Numéro de carte d 'identité
lbl_idcard_org.Caption=Autorité de délivrance
lbl_idcard_addr.Caption=Adresse
lbl_idcard_begin.Caption=Période de validité
lbl_idcard_end.Caption=Fin de validité
lbl_idcard_type.Caption=Type d 'équipement
btn_idcard_read.Caption=Lire
lbl_idcard_msg.Caption=Message:

[frmAbout]
btnOk.Caption=Oui.
Caption=Sur

[LanguageString]
ini_NeedRegister=Imprimer trop de fois, s' il vous plaît redémarrer la fiche d 'impression ou acheter la version OEM
ini_NoToken=Token n'existe pas.
ini_ReadIdCardError=La carte de lecture échoue!
ini_GetPrinterList=Acquisition d 'une liste d' imprimantes
ini_CreateDir=Créer un répertoire
ini_FailPleaseCheck=Échec, vérifiez.
ini_PrintFailPleaseCheck=Impossible d 'imprimer, vérifiez.
ini_ReportFileNotExist=Aucun fichier de rapport
ini_DownLoadError=Erreur de téléchargement
ini_JsonFormatError=Erreur dans le format json
ini_PrintingTimeoutPleaseCheck=Temps d 'impression
ini_PictureFormatError=Image Format incorrect
ini_PdfFileNotExist=Fichier PDF non disponible
ini_PicFileNotExist=Le fichier pic n 'existe pas.
ini_This=Devoir
ini_NotSupport=Non.
ini_InterfaceCallFailed=Erreur d 'appel d' interface
ini_CameraNotActivated=La caméra n'est pas allumée.
ini_SelectFolder=Sélectionner le dossier
ini_MinutesMustBeAnInteger=Les minutes doivent être entières.
ini_MinutesMustBeGreaterThanZero=Les minutes doivent être supérieures à zéro.
ini_SelfStartingClientNameCannotBeEmpty=Nom du client de démarrage automatique


ini_PdfFileCannotOpen=Impossible d 'ouvrir le fichier PDF
ini_LicenseKeyInvalid=Clé de licence


ini_PicFileCannotOpen=Impossible d 'ouvrir le fichier pic
ini_UnableInitializePrinter=Impossible d 'initialiser une imprimante
ini_PicPrint=Impression pic
ini_PaperSize=Taille du papier
ini_CustomMM=Personnaliser(MM)
ini_Width=Largeur
ini_Height=Altitude
ini_PrintingDirection=Direction d 'impression
ini_landscape=Horizontal
ini_portrait=Vertical
ini_MarginMM=Marge de page(MM)
ini_Left=Gauche
ini_Right=Droite.
ini_Top=Allez.
ini_Bottom=Descendre
ini_Center=Milieu
ini_VerticalPos=Position verticale
ini_HorizontalPos=Horizontal position
ini_Copys=Part
ini_DocumentTitle=Titre du document
ini_PrinterName=Nom de l 'imprimante
ini_PageZoom=Zoom de page
ini_Normal=Détermination de la taille d 'impression selon le DPI de l' image originale (c 'est - à - dire création d' une copie de la taille réelle)
ini_FitToPage=étirer l 'image pour l' adapter à la page tout en respectant sa proportion
ini_FitToPageStretch=Extension de l 'image pour correspondre à la page
ini_FillPage=Extension de l 'image pour remplir toute la page (en proportion)
ini_SpecifiedSize=Impression de taille absolue spécifiée par des paramètres de largeur absolue et de hauteur absolue
ini_MultiplePages=Impression d 'images (affiches) sur plusieurs pages avec des nombres spécifiés par des paramètres de largeur absolue et de hauteur absolue
ini_SpecWidth=Largeur absolue
ini_SpecHeight=Altitude absolue
ini_LoadPic=Charger une image
ini_ConfirmPrinting=Confirmation de l 'impression




ini_PrintLog=Journal d 'impression
ini_Date=Date
ini_Refresh=Rafraîchir
ini_OpenLogDirectory=Ouvrir le journal
ini_OpenOutputFileDirectory=Ouvrir la liste des fichiers de sortie
ini_ViewCustomFile=Fichier personnalisé
ini_LogList=Liste de journal
ini_LogContent=Contenu du Journal
ini_PdfFile=Fichier PDF
ini_Directory=Table des matières
ini_NotExist=Non.






ini_ReportDesign=Rapport Design
ini_DoubleClickToOpenTheReportFile=Double - cliquez pour ouvrir le fichier de rapport
ini_NewlyAdded=Ajouter
ini_Modify=Modifier
ini_Delete=Delete
ini_Copy=Copier
ini_ReportDoesNotExist=Le rapport n 'existe pas
ini_To=Convertir
ini_Error=Erreur
ini_InTheListBelow_selectTheReportFileYouWantToModify=Veuillez sélectionner le fichier de rapport à modifier dans la liste ci - dessous
ini_TestReport=Rapport d 'essai
ini_AreYouSureYouWantToDelete=Voulez - vous confirmer la suppression
ini_DeleteConfirmation=Delete confirmation
ini_YouHaveChosenNotToDelete=Vous avez choisi de ne pas supprimer
ini_ReportNameEn=Nom du rapport
ini_ReportNameAlias=Nom du rapport
ini_VersionNumber=Numéro de version
ini_FileNameSuffixMustBe=Nom de fichier
ini_Currently=Actuellement
ini_TheFileNameAlreadyExists=Le nom de fichier existe déjà
ini_ReportInfo=Informations de rapport




ini_NoJsonFile=Fichier json manquant
ini_PrintErrorJsonError=Erreur d 'impression
ini_MustBe=Il faut
ini_Or=Ou
ini_ReportName=Nom du rapport
ini_CannotBeEmpty=Pas pour rien.
ini_MustBeIntOrFloat=Doit être une décimale ou un type entier
ini_DeleteLocalReportFile=Delete Local Report file
ini_DownLoadReportFileToLocal=Télécharger un rapport à distance
ini_DownLoadReportFileError=Down Report file Error
ini_DownLoadComplete=Téléchargement terminé.
ini_EditLocalReportVersion=Modifier le numéro de version du rapport local
ini_CreateReportFile=Créer un fichier de rapport
ini_PrintCopys=Nombre d 'exemplaires
ini_MustBeInt=Type entier
ini_MustBeGreaterThanOrEqualTo=Il doit être supérieur à zéro.
ini_DetermineIfThePrinterExists=Déterminer si une imprimante existe
ini_Printer=Imprimante
ini_NotExistPayAttentionToCaseAndSpace=Il n'y en a pas. Attention à la taille, à l'écriture et à l'espace.
ini_SetRightOffset=Réglage du décalage droit
ini_MustBeFloat=Type de point flottant
ini_SetBottomOffset=Définir le décalage de fond
ini_MustBeOneOrZero=Il doit être un ou zéro.
ini_SetComponent=Cadre de composant
ini_Component=Cadre de composant
ini_ControlToArrayError=Control a fait une erreur.
ini_LoadPicError=Erreur de chargement
ini_FormatError=Erreur de présentation
ini_Parameter=Paramètres
ini_ParameterToArrayError=Parameter s'est trompé.
ini_Field=Champ
ini_FieldToArrayError=Field a fait une erreur.
ini_AFieldToArrayError=AField a fait une erreur.
ini_BFieldToArrayError=BField a fait une erreur.
ini_CFieldToArrayError=CField a fait une erreur.
ini_DFieldToArrayError=DField a fait une erreur.
ini_EFieldToArrayError=EField a fait une erreur.
ini_FFieldToArrayError=FField a fait une erreur.
ini_GFieldToArrayError=GField a fait une erreur.
ini_HFieldToArrayError=HField a fait une erreur.
ini_IFieldToArrayError=IField a fait une erreur.
ini_JFieldToArrayError=JField a fait une erreur.
ini_DataRow=Ligne de données
ini_DataToArrayError=Data a fait une erreur.
ini_ADataToArrayError=AData a fait une erreur.
ini_BDataToArrayError=BData a fait une erreur.
ini_CDataToArrayError=CData a fait une erreur.
ini_DDataToArrayError=DData a fait une erreur.
ini_EDataToArrayError=EData a fait une erreur.
ini_FDataToArrayError=FData a fait une erreur.
ini_GDataToArrayError=GData a fait une erreur.
ini_HDataToArrayError=HData a fait une erreur.
ini_IDataToArrayError=IData a fait une erreur.
ini_JDataToArrayError=JData a fait une erreur.
ini_SetOffsetValue=Valeur de décalage
ini_SetPrinterName=Nom de l 'imprimante
ini_ExportFileYes=Exporter le fichier
ini_ExportFileName=Nom du fichier d 'exportation
ini_ExportComplete=Export terminé.
ini_PreviewComplete=Terminé.
ini_PrintComplete=Impression terminée.
ini_LoadReport=Rapport de chargement
ini_ADataToArraySuccess=AData est passée à Array.
ini_BDataToArraySuccess=BData est passée à Array.
ini_CDataToArraySuccess=CData est passée à Array.
ini_DDataToArraySuccess=DData est passée à Array.
ini_EDataToArraySuccess=EData est passée à Array.
ini_FDataToArraySuccess=FData est passée à Array.
ini_GDataToArraySuccess=JData est passée à Array.
ini_HDataToArraySuccess=HData est passée à Array.
ini_IDataToArraySuccess=IData est passée à Array.
ini_JDataToArraySuccess=JData est passée à Array.



ini_NoClientID=Pas de valeur de clientid.
ini_ClientIDEmpty=Clientid ne peut pas être vide.
ini_PrinteridWrong=Printerid Non.
ini_PrinterpwdWrong=printerpwd Non.
ini_MethodWrong=Method est incorrect.
ini_PingSuccessful=Ping a réussi.
ini_PingTimeout=Heures supplémentaires
ini_ConnectionResults=Résultat de connexion
ini_subscribeResultMessageID=Résultat d 'abonnement
ini_UnsubscribeResultMessageID=Annulation d 'abonnement
ini_Received_release_confirmation_QoS_1_message_ID=Accusé de réception Qos 1 , message id
ini_Receive_release_confirmation_step_1_of_QoS_2_message_ID=Bien reçu. Confirmation de publication. Étape 1, message Id.
ini_Receive_release_confirmation_step_3_of_QoS_2_message_ID=Bien reçu. Confirmation de diffusion. Étape 3, message Id.
ini_Receive_release_confirmation_step_2_of_QoS_2_message_ID=Bien reçu. Confirmation de publication. Étape 2, message Id.
ini_ConnectionTimedOut=Temps de connexion
ini_PublishingTimeout=Délai de publication
ini_MessageID=Message id
ini_Topic=Thème
ini_Content=Contenu
ini_CameraOn=La caméra est ouverte.
ini_OpenFailed=Défaite
ini_NoVideoDevicesWereFound=Pas de vidéo.
ini_Stopped=Stop
ini_CameraStartFailed=La caméra a échoué.
ini_CameraOff=Les caméras sont éteintes.
ini_Disconnect=Déconnecter
ini_Started=Activé.
ini_Failed_to_start_Please_try_another_port=Démarrage raté. Essayez un autre port.
ini_Minimum_desktop_requirements_Windows_Vista=Minimum Requirements for Desktop Edition: Windows Vista
ini_Minimum_server_requirements_Windows_Server_2008=Minimum Requirements for the server: Windows - Server 2008




ini_Table_structure_field_type=Type de champ de structure de table ftblob (format de base 64), ftstring - ftnteger, ftfloat, ftcurrency, ftdatetime,
ini_size_ftString_ftInteger_ftBlob=Size (ftstring est la longueur réelle et les autres paramètres sont 0, par exemple ftinteger - ftblob et ainsi de suite 0)
ini_Currently_10_tables_are_supported=Le tableau A contient le tableau afield - adata jusqu 'au tableau J contient le tableau jfield - jdata.







ini_ParameterSetting=Paramètres
ini_Log_save_path_if_empty_the_default_is_log_directory=Enregistrer le chemin dans le journal
ini_Clear_log_on_startup=Journal de démarrage
ini_Clear_log_on_exit=Journal de retrait
ini_In_operation_every=En cours de fonctionnement, toutes les radios minutes.
ini_Save_settings=Enregistrer les paramètres
ini_journal=Journal
ini_report_form=Rapport
ini_Report_template_path_empty_default_report_directory=Chemin de modèle de rapport (Répertoire par défaut vide)
ini_Export_file_path_empty_default_export_directory=Output file path(format export par défaut vide)
ini_Export_file_format_blank_default_PDF_format=Exporter le format de fichier (format PDF par défaut vide)
ini_Enable_token=Activer token
ini_Token_list_one_for_each_line_similar_to_white_list=Liste de token
ini_other=Autres
ini_Minimize_after_startup=Minimisation après démarrage
ini_Customize_the_client_name_so_that_it_can_start_multiple_clients=Nom de client personnalisé permettant de démarrer plusieurs clients



ini_URL_encoding_decoding=Codage / décodage d 'URL
ini_URLEncode=Code urlencode
ini_URLDecode=Décodage urldecode


ini_Base64_and_image_conversion=Base64 and image conversion
ini_exceed_100k=Afin d 'équilibrer l' efficacité dans l 'environnement de production, les fichiers photographiques individuels ne doivent pas dépasser 100k.
ini_Base64_string=Chaîne de base 64
ini_paste=Coller
ini_Turn_to_picture=Image
ini_picture=Photo



ini_Connection=Connexion
ini_write_log=Générer un journal